Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: session.cache_limiter
pt_br: WDDX está apenas disponível, se o PHP está compilado com o suporte WDDX support.

source: session.cache_expire
pt_br: Por definição php.

source: session.use_trans_sid
pt_br: session.gc_probability especifica a probabilidade que a rotina gc (coleção de lixo-garbage collection) é iniciada em cada pedido em porcentagem.

source: PHP_INI_SYSTEM _BAR_ PHP_INI_PERDIR
pt_br: Por definição 1.

source: "a=href,area=href,frame=src,input=src,form=fakeentry"
pt_br: session.gc_maxlifetime especifica o número de segundos depois que o dado será visto como 'lixo' e limpado.

source: The session management system supports a number of configuration options which you can place in your php.ini file.
pt_br: session.referer_check session.referer_check contém a substring que você quer checar cada HTTP Referer para.

source: session.save_handler defines the name of the handler which is used for storing and retrieving data associated with a session.
pt_br: Se o Referer foi enviado pelo cliente e a substring não foi encontrada, a id de sessão embutida será percebida como inválida.

source: See also session_set_save_handler().
pt_br: Por definição uma string vazia.

source: If you choose the default files handler, this is the path where the files are created.
pt_br: session.entropy_file session.entropy_file dá um caminho para um recurso externo( file) que será usado como um entropy source na criação da id de sessão.

source: See also session_save_path().
pt_br: São exemplos / dev / random ou / dev / urandom que estão disponéveis em muitos Sistemas Unix.

source: If you leave this set to a world-readable directory, such as / tmp (the default), other users on the server may be able to hijack sessions by getting the list of files in that directory.
pt_br: session.entropy_length especifíca o número de bytes que serão lidos do arquivo especificado acima.

source: Windows users have to change this variable in order to use PHP 's session functions.
pt_br: Por definição 0 (desabilitada).

source: session.name session.name specifies the name of the session which is used as cookie name.
pt_br: session.use_cookies session.use_cookies especifica se o módulo usará cookies para gravar a id de sessão no lado do cliente.

source: Defaults to PHPSESSID.
pt_br: Por definição 1 (habilitada).

source: session.auto_start specifies whether the session module starts a session automatically on request startup.
pt_br: session.use_only_cookies especifica se o módulo usará apenas cookies para gravar a id de sessão no lado do cliente.

source: Defaults to 0 (disabled).
pt_br: Por definição 0 (desabilitada).

source: Currently, a PHP internal format (name php) and WDDX is supported (name wddx).
pt_br: Habilitar esta definição previni ataques envolvendo id de sessão passadas em URLs.

source: WDDX is only available, if PHP is compiled with WDDX support.
pt_br: Esta definição foi adicionada no PHP 4.3.0.

source: session.gc_probability specifies the probability that the gc (garbage collection) routine is started on each request in percent.
pt_br: session.cookie_path session.cookie_path especifica o caminho para definir em session_cookie.

source: Defaults to 1.
pt_br: Por definição /.

source: Windows FAT does not so you will have to come up with another way to handle garbage collecting your session if you are stuck with a FAT filesystem or any other fs where atime tracking is not available.
pt_br: Nenhuma definição.

source: If the Referer was sent by the client and the substring was not found, the embedded session id will be marked as invalid.
pt_br: session.cache_limiter especifica o método de controle do cache para usar para páginas de sessão (none / nocache / private / private_no_expire / public).

source: Defaults to the empty string.
pt_br: Por definição nocache.

source: Examples are / dev / random or / dev / urandom which are available on many Unix systems.
pt_br: session.cache_expire session.cache_expire especifica o tempo de vida para páginas de sessão no cache em minutos, isto não tem efeito para para limitador sem cache.

source: session.entropy_length specifies the number of bytes which will be read from the file specified above.
pt_br: Por definição 180.

source: session.use_cookies session.use_cookies specifies whether the module will use cookies to store the session id on the client side.
pt_br: session.use_trans_sid se o suporte de sid transparente está habilitado ou não, se habilitado por compilação com --enable-trans-sid.

source: Defaults to 1 (enabled).
pt_br: Por definição 1 (habilitado).

source: Defaults to 0 (disabled, for backward compatibility).
pt_br: url_rewriter.tags url_rewriter.tags especifica quais tags html estão reescritas para incluir id de sessão se o suporte transparente de sid está habilitado.

source: This setting was added in PHP 4.3.0.
pt_br: Por definição a=href,area=href,frame=src,input=src,form=fakeentry

source: The value 0 means "until the browser is closed." Defaults to 0 .See also session_get_cookie_params() and session_set_cookie_params().
pt_br: A configuração de track_vars e register_globals influencia em como as variáveis da sessão conseguem armazenar e devolver.

source: session.cookie_path session.cookie_path specifies path to set in session_cookie.
pt_br: Nota:

source: session.cookie_domain specifies the domain to set in session_cookie.
pt_br: No PHP 4.0.3, track_vars está sempre ligada.

source: See also session_get_cookie_params() and session_set_cookie_params().
pt_br: Tipos Resource

source: Defaults to off.
pt_br: Esta extensão não possui nenhum tipo resource.

source: Defaults to nocache.
pt_br: As contantes abaixo são definidas por esta extensão e somente estarão disponíveis quando a extensão foi compilada com o PHP ou carregada dinamicamente durante a execução.

source: Defaults to 180.
pt_br: Exemplos

source: See also session_cache_expire().
pt_br: Nota:

source: For PHP 4.1.2 or less, it is enabled by compiling with --enable-trans-sid.
pt_br: Não como $HTTP_SESSION_VARS, $_SESSION está sempre global.

source: URL based session management has additional security risks compared to cookie based session management.
pt_br: Então, global poderia não ser usada para $_SESSION.

source: url_rewriter.tags url_rewriter.tags specifies which html tags are rewritten to include session id if transparent sid support is enabled.
pt_br: Se track_vars is habilitada e register_globals está desabilitada, apenas aquelas membros da matriz associativa $HTTP_SESSION_VARS Se track_vars is habilitada e register_globals está desabilitada, apenas aquelas membros da matriz associativa $HTTP_SESSION_VARS podem ser registradas em uma sessão de variáveis.

source: The track_vars and register_globals configuration settings influence how the session variables get stored and restored.
pt_br: A sessão de variáveis restauradas somente estarão disponíveis na matriz $HTTP_SESSION_VARS.

source: As of PHP 4.0.3, track_vars is always turned on.
pt_br: Registrando uma variável com track_vars habilitada

source: Unlike $HTTP_SESSION_VARS, $_SESSION is always global.
pt_br: Com $_SESSION ou $HTTP_SESSION_VARS, não á necessidade de usar as funções session_register() / session_unregister() / session_is_registered().

source: Therefore, you do not need to use the global keyword for $_SESSION.
pt_br: Usuários podem acessar variável de sessão como uma variável normal.

source: Please note that this documentation has been changed to use $_SESSION everywhere.
pt_br: Exemplo 2.

source: You can substitute $HTTP_SESSION_VARS for $_SESSION, if you prefer the former.
pt_br: Registrando uma variável com $_SESSION.

source: For more details see the section on variables in this manual.
pt_br: Exemplo 3.

source: If register_globals is disabled, only members of the global associative array $_SESSION can be registered as session variables.
pt_br: Desregistrando uma variável com $_SESSION.

source: Session variables are accessible like any other variables.
pt_br: Se a register_globals está habilitada, então todas as variáveis globais podem ser registradas como variáveis de sessão e as variáveis de sessão serão restauradas para a variável global correspondente.

source: ?php session_start(); / / Use $HTTP_SESSION_VARS with PHP 4.0.6 or less if (!isset($_SESSION['count'])) {$_SESSION['count'] = 0;} else {$_SESSION['count']++;}?
pt_br: Visto que o PHP deve saber quais variáveis globais estão registradas como variáveis de sessão, usuaários devem registrar variáveis com a função session_register() enquanto $HTTP_SESSION_VARS / $_SESSION não necessita utilizar session_register().

source: ?php session_start(); / / Use $HTTP_SESSION_VARS with PHP 4.0.6 or less unset($_SESSION['count']);?
pt_br: Se você está usando $HTTP_SESSION_VARS / $_SESSION e desabilitada register_globals, não faça uso de session_register(), session_is_registered() e session_unregister().

source: ?php session_start(); / / With PHP 4.3 and later, you can also simply use the prior example. session_unregister('count');?
pt_br: Se você habilita register_globals, session_unregister() Se você habilita register_globals, session_unregister() poderiam ser usadas desde que as variáveis de sessão estejam registradas como variáveis globais quando os dados da sessão não estão em série.

source: If register_globals is enabled, then each global variable can be registered as session variable.
pt_br: Desabilitar register_globals é recomendado para ambas razões, segurança e performance.

source: Upon a restart of a session, these variables will be restored to corresponding global variables.
pt_br: Registrando uma variável com register_globals habilitada

source: If you are using $_SESSION and disable register_globals, do not use session_register(), session_is_registered() and session_unregister(), if your scripts shall work in PHP 4.2 and earlier.
pt_br: Se ambas track_vars e register_globals estão habilitadas, então as variáveis globais e as entradas $HTTP_SESSION_VARS / $_SESSION farão referência ao mesmo valor para as variáveis já registradas.

source: If you enable register_globals, session_unregister() If you enable register_globals, session_unregister() should be used since session variables are registered as global variables when session data is deserialized.
pt_br: Se o usuário utiliza session_register() para registrar variável de sessão, $HTTP_SESSION_VARS / $_SESSION não terão esta variável numa matriz até que ela seja lida de um armazém de sessão. (i.e. até o próximo pedido)

source: Disabling register_globals is recommended for both security and performance reasons.
pt_br: Passando a ID de sessão

source: Registering a variable with register_globals enabled
pt_br: Há dois métodos para propagar uma id de sessão:

source: There is a defect in PHP 4.2.3 and earlier.
pt_br: Parâmetro URL

source: If you register a new session variable by using session_register(), the entry in the global scope and the $_SESSION entry will not reference the same value until the next session_start().
pt_br: Módulo de sessão suporta ambos os métodos.

source: This has been corrected in PHP 4.3.
pt_br: Cookies são mais eficientes, mas se eles não estiverem autorizados (clientes não são obrigados a aceita-los), nós não podemos conter deles.

source: Cookies
pt_br: O segundo método inclui a id de sessão diretamente na URL.

source: The session module supports both methods.
pt_br: PHP é capaz de fazer isto transparentemente quando compilado com --enable-trans-sid.

source: Cookies are optimal, but because they are not always available, we also provide an alternative way.
pt_br: Se você habilitar esta opção, URIs ligadas serão automaticamente mudadas para conter a id de sessão.

source: PHP is capable of transforming links transparently.
pt_br: Alternativamente, você pode usar a constante SID que é definida, se o cliente não enviar o cookie apropriado.

source: Unless you are using PHP 4.2 or later, you need to enable it manually when building PHP.
pt_br: SID é do formulário session_name=session_id ou é uma string vazia.

source: Under UNIX, pass --enable-trans-sid to configure.
pt_br: Nota:

source: If this build option and the run-time option session.use_trans_sid are enabled, relative URIs will be changed to contain the session id automatically.
pt_br: A diretriz arg_separator.output php.ini permite personalizar o argumento separador.

source: The arg_separator.output php.ini directive allows to customize the argument seperator.
pt_br: O seguinte exemplo demonstra como registrar uma variável, e e como ligar corretamente a outra página usando SID.

source: For full XHTML conformance, specify amp; there.
pt_br: Exemplo 5.

source: Alternatively, you can use the constant SID which is always defined.
pt_br: Contar o número de visitas de um simples usuário

source: The following example demonstrates how to register a variable, and how to link correctly to another page using SID.
pt_br: Hello visitor, you have seen this page ?php echo $count;? times. p; ?php # the ?php echo SID? (?=SID? can be used if short tag is enabled) # is necessary to preserve the session id # in the case that the user has disabled cookies?

source: Counting the number of hits of a single user
pt_br: To continue, A HREF=" nextpage.php? ?php echo SID? "click here / A

source: ?php if (!session_is_registered('count')) {session_register('count'); $count = 1;} else {$count++;}?
pt_br: A ?=SID? não é necessário, se --enable-trans-sid foi usada para compilar o PHP.

source: The ?php echo SID? (?=SID? can be used if short_open_tag is enabled) is necessary to preserve the session id in the case that the user has disabled cookies.
pt_br: URLs não ligadas estão assumidas para apontar para sites externos e portanto não anexam a SID, pois ela poderia escapar para outro servidor.

source: To implement database storage, or any other storage method, you will need to use session_set_save_handler() to create a set of user-level storage functions.
pt_br: Para implementar o armazenamento num banco de dados, ou qualque outra forma de aramzenamento, você vai precisar usar session_set_save_handler() * para define as funções de armazenamento que são usadas (* to create a set of user-level storage functions).

source: Shmop is an easy to use set of functions that allows PHP to read, write, create and delete UNIX shared memory segments.
pt_br: Shared Memory Functions

source: In PHP 4.0.3, these functions were prefixed by shm rather than shmop.
pt_br: Requisitos

source: To use shmop you will need to compile PHP with the --enable-shmop parameter in your configure line.
pt_br: Configuração durante execução

source: Shared Memory Operations Overview
pt_br: Exemplo 1.

source: In order to use the SNMP functions on Unix you need to install the UCD SNMP package.
pt_br: SNMP functions

source: On Windows these functions are only available on NT and not on Win95 / 98.
pt_br: Requisitos

source: In order to use the UCD SNMP package, you need to define NO_ZEROLENGTH_COMMUNITY to 1 before compiling it.
pt_br: Instalação

source: This directory should be moved to DRIVE:\usr\mibs, where DRIVE must be replaced with the driveletter where PHP is installed on, e.g.: c:\usr\mibs.
pt_br: Configuração durante execução

source: The socket functions described here are part of an extension to PHP which must be enabled at compile time by giving the --enable-sockets option to configure.
pt_br: Configuração durante execução

source: Die Adresse wird bereits verwendet
pt_br: Exemplos

source: There are many wrappers built into PHP by default (See Appendix I), and additional, custom wrappers may be added either within a PHP script using stream_register_wrapper(), or directly from an extension using the API Reference in Chapter 43.
pt_br: There are many wrappers built into PHP by default (See Apêndice I), and additional, custom wrappers may be added either within a PHP script using stream_register_wrapper(), or directly from an extension using the API Reference in Capítulo 43.

source: Custom filters can be defined in a PHP script using stream_register_filter() or in an extension using the API Reference in Chapter 43.
pt_br: Custom filters can be defined in a PHP script using stream_register_filter() or in an extension using the API Reference in Capítulo 43.

source: See Appendix I for a list of PHP builtin wrappers.
pt_br: See Apêndice I for a list of PHP builtin wrappers.

source: Again, see Appendix I for a description of targets for builtin streams.
pt_br: Requisitos

source: No steps are required to enable them.
pt_br: Configuração durante execução

source: See the manual page for stream_register_filter() for details on implementing user defined filters.
pt_br: Constantes Predefinidas

source: As with most PHP internal functions if a failure occours an E_WARNING message will be generated describing the nature of the error.
pt_br: Exemplos

source: These functions all manipulate strings in various ways.
pt_br: String functions

source: Some more specialized sections can be found in the regular expression and URL handling sections.
pt_br: Todas estas funções manipulam strings de várias maneiras.

source: For information on how strings behave, especially with regard to usage of single quotes, double quotes, and escape sequences, see the Strings entry in the Types section of the manual.
pt_br: Para informações de como a string se comporta, especialmente com realção ao uso de aspas simples, aspas duplas, seqüências de escape, veja o Strings dentro da sessão Types do manual.

source: For even more powerful string handling and manipulating functions take a look at the POSIX regular expression functions and the Perl compatible regular expression functions.
pt_br: Para as mais poderosas funções de manipulação de strings dê uma olhada em POSIX regular expression functions e Perl compatible regular expression functions.

source: PHP offers the ability to create Shockwave Flash files via Paul Haeberli 's libswf module.
pt_br: Shockwave Flash functions

source: The libswf does not have support for Windows.
pt_br: Nota:

source: Consequently you will have to copy the files to the proper location manually.
pt_br: Configuração durante execução

source: If magic_quotes_sybase is on, a single-quote is escaped with a single-quote instead of a backslash if magic_quotes_gpc or magic_quotes_runtime are enabled.
pt_br: C.

source: This value can also be set from a script by calling sybase_min_client_severity().
pt_br: Funções Sybase

source: See also unserialize().
pt_br: Tipos Resource

source: This extension is a generic extension API to DLLs.
pt_br: Introdução

source: These functions are intended for work with WDDX.
pt_br: WDDX Functions

source: XML (eXtensible Markup Language) is a data format for structured document interchange on the Web.
pt_br: XML parser functions

source: This behaviour can be queried and controlled per XML parser with the xml_parser_get_option() and xml_parser_set_option() functions, respectively.
pt_br: Error Codes

source: Currently, this means that such characters are replaced by a question mark.
pt_br: Exemplos

source: $file = "data.xml"; $depth = array(); function startElement($parser, $name, $attrs) {global $depth; for ($i = 0; $i $depth[$parser]; $i++) {print" ";} print "$name\n"; $depth[$parser]++;} function endElement($parser, $name) {global $depth; $depth[$parser]--;} $xml_parser = xml_parser_create(); xml_set_element_handler($xml_parser, "startElement", "endElement"); if (!($fp = fopen($file, "r"))) {die("could not open XML input");} while ($data = fread($fp, 4096)) {if (!xml_parse($xml_parser, $data, feof($fp))) {die(sprintf("XML error: %s at line %d", xml_error_string(xml_get_error_code($xml_parser)), xml_get_current_line_number($xml_parser)));}} xml_parser_free($xml_parser);
pt_br: XML Tag Mapping Example

source: $file = "data.xml"; $map_array = array ("BOLD" = "B", "EMPHASIS "= "I", "LITERAL" = "TT "); function startElement($parser, $name, $attrs) {global $map_array; if ($htmltag = $map_array[$name]) {print" $htmltag ";}} function endElement($parser, $name) {global $map_array; if ($htmltag = $map_array[$name]) {print" / $htmltag ";}} function characterData($parser, $data) {print $data;} $xml_parser = xml_parser_create(); / / use case-folding so we are sure to find the tag in $map_array xml_parser_set_option($xml_parser, XML_OPTION_CASE_FOLDING, true); xml_set_element_handler($xml_parser, "startElement", "endElement"); xml_set_character_data_handler($xml_parser, "characterData"); if (!($fp = fopen($file, "r"))) {die("could not open XML input");} while ($data = fread($fp, 4096)) {if (!xml_parse($xml_parser, $data, feof($fp))) {die(sprintf("XML error: %s at line %d", xml_error_string(xml_get_error_code($xml_parser)), xml_get_current_line_number($xml_parser)));}} xml_parser_free($xml_parser);
pt_br: XML External Entity Example

source: Example 4. xmltest.xml
pt_br: Exemplo 4. xmltest.xml

source: Example 5. xmltest2.xml
pt_br: Exemplo 5. xmltest2.xml

source: These functions can be used to write XML-RPC servers and clients.
pt_br: Introdução

source: This extension is bundled into PHP as of 4.1.0.
pt_br: Configuração durante execução

source: This PHP extension provides a processor independent API to XSLT transformations.
pt_br: XSLT functions

source: You can find news information, example scripts, etc. for this extension at http: / /www.indexdata.dk / phpyaz /.
pt_br: Instalação

source: This module enables you to transparently read ZIP compressed archives and the files inside them.
pt_br: Zip File Functions (Read Only Access)

source: A normal ZIP utility is needed to create the ZIP file archives read by this library.
pt_br: Instalação

source: This section reflects the Zip extension as it exists in PHP 4.1.0 and later.
pt_br: Configuração durante execução

source: This module enables you to transparently read and write gzip (.gz) compressed files, through versions of most of the filesystem functions which work with gzip-compressed files (and uncompressed files, too, but not with sockets).
pt_br: Funções de Compressão Zlib

source: Version 4.0.4 introduced a fopen-wrapper for .gz-files, so that you can use a special 'zlib:' URL to access compressed files transparently using the normal f*() file access functions if you prepend the filename or path with a'zlib: 'prefix when calling fopen().
pt_br: Nota:

source: This feature requires a C runtime library that provides the fopencookie() This feature requires a C runtime library that provides the fopencookie() function.
pt_br: A Versão 4.0.4 introduziu a função fopen-wrapper para arquivos .gz, então você pode usar o prefixo 'zlib:' especial para acessar arquivos comprimidos transparentemente usando as funções normais de acesso a arquivos f*() se você concatenar o nome do arquivo e ou seu caminho com o prefixo 'zlib: 'quando usar a função fopen().

source: To my current knowledge the GNU libc is the only library that provides this feature.
pt_br: Na versão 4.3.0, este prefixo especial foi mudado para 'zlib: / /' para previnir ambiguidades com nome de arquivos contendo ':'.

source: This module uses the functions of zlib by Jean-loup Gailly and Mark Adler.
pt_br: Esta facilidade requer uma biblioteca em tempo de execução que provê a função fopencookie().

source: Zlib support in PHP is not enabled by default.
pt_br: Em meu conhecimento atual a GNU libc é a única bliblioteca que provê esta facilidade.

source: You will need to configure PHP --with-zlib[ =DIR]
pt_br: Requisitos

source: Builtin support for zlib is available with PHP 4.3.0.
pt_br: Configuração durante execução
